# GetColumnHeader Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTable..::..GetColumnHeader Method
FamilySizeTable Class See Also
---
Gets a column of the table at at given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FamilySizeTableColumn GetColumnHeader(
	int index
)
```

Visual Basic
---
```text
Public Function GetColumnHeader ( _
	index As Integer _
) As FamilySizeTableColumn
```

Visual C++
---
```text
public:
FamilySizeTableColumn^ GetColumnHeader(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 Index of the column.
# ### Return Value
The column at the given index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The column index is out of range. |

# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace